# 総当たりじゃTLE
# 凸包とか出てきたけどたぶん違う気がする
# 実験大事
# 凸包云々が大事なのはユークリッド距離だな
# チェビシェフ距離なら座標の差でいいな
# と思ったけどXの最大とYの最大が一緒になる
# (本来は同じ座標なのに別としてカウントされる)ことがある

N = int(input())
X = []
Y = []

for i in range(N):
    x, y = map(int, input().split(" "))
    X.append([x, i])
    Y.append([y, i])

X = sorted(X)
Y = sorted(Y)

x_1 = [X[-1][0] - X[0][0], f"{X[-1][1]}-{X[0][1]}"]
x_2 = [X[-1][0] - X[1][0], f"{X[-1][1]}-{X[1][1]}"]
x_3 = [X[-2][0] - X[0][0], f"{X[-2][1]}-{X[0][1]}"]

y_1 = [Y[-1][0] - Y[0][0], f"{Y[-1][1]}-{Y[0][1]}"]
y_2 = [Y[-1][0] - Y[1][0], f"{Y[-1][1]}-{Y[1][1]}"]
y_3 = [Y[-2][0] - Y[0][0], f"{Y[-2][1]}-{Y[0][1]}"]
C = list(reversed(sorted([x_1, x_2, x_3, y_1, y_2, y_3])))

if C[1][1] == C[0][1]:
    print(C[2][0])
else:
    print(C[1][0])

# AC 22m
# そういうことでした
